src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаЯндексМетрика/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.ЯндексМетрика;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование(); 
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	КонецЕсли;
	
	ЗаполнитьСоответствияДоменамСЕ();

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет соответствия доменным именам структурных единиц.
//
Процедура ЗаполнитьСоответствияДоменамСЕ()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницы.ПометкаУдаления");
	
	СписокСЕ = Запрос.Выполнить().Выгрузить();
		
	МассивСтруктурныхЕдиниц = Новый Массив;
		
	СтруктураПараметров = Объект.Ссылка.Параметры.Получить();
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") И СтруктураПараметров.Свойство("МассивСтруктурныхЕдиниц") Тогда				
		МассивСтруктурныхЕдиниц = СтруктураПараметров.МассивСтруктурныхЕдиниц;		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СписокСЕ Цикл
		
		НоваяСтрока = ЭтотОбъект.СоответствиеСЕИдентификаторамресурса.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = СтрокаТЧ.Ссылка;
		
		Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
			
			Для Каждого ЭлементМ Из МассивСтруктурныхЕдиниц Цикл
				
				Если СтрокаТЧ.Ссылка = ЭлементМ.СтруктурнаяЕдиница Тогда
					НоваяСтрока.Счетчик = ЭлементМ.Счетчик;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СоответствиеСЕИдентификаторамресурса Цикл			
		МассивСтруктурныхЕдиниц.Добавить(Новый Структура("СтруктурнаяЕдиница, Счетчик", СтрокаТч.СтруктурнаяЕдиница, СтрокаТч.Счетчик)); 			
	КонецЦикла;	
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы.Свойство("МассивСтруктурныхЕдиниц") Тогда
		ПараметрыВнешнейСистемы.МассивСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	КонецЕсли;

	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
	
КонецПроцедуры

 &НаКлиенте
 // Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
 //
 Процедура УдалитьИЗакрыть(Команда)
	 
	 Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	 ЭтотОбъект);	
	 
	 ПоказатьВопрос(Оповещение,
	 "Вы точнохотите пометить на удаление данный элемент справочника?",
	 РежимДиалогаВопрос.ДаНетОтмена,
	 0, 
	 КодВозвратаДиалога.Да
	 );    
	 
	 
 КонецПроцедуры
 
 &НаКлиенте
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	 
	 Если Результат = КодВозвратаДиалога.Да Тогда
		 
		 ПометитьНаУдаление();
		 
		 ПараметрыОповещения = Новый Структура;
		 ПараметрыОповещения.Вставить("ВнешняяСистема"	 , Объект.Ссылка);
		 ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		 
		 Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		 
		 ЭтаФорма.Закрыть();
	 КонецЕсли;	
	 
 КонецПроцедуры 
 
 &НаСервере
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПометитьНаУдаление()
	 
	 ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	 ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	 ВнешняяСистемаОбъект.Используется = Ложь;
	 
	 Попытка
		 ВнешняяСистемаОбъект.Записать();
	 Исключение 
	 КонецПопытки;
	 
 КонецПроцедуры

#КонецОбласти
